---
type: ImporterIFCUtils
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 2
tags: [revit-api, class]
---

# ImporterIFCUtils

`Autodesk.Revit.DB.IFC.ImporterIFCUtils` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateEmptyFamily | 2014 | `public static ElementId CreateEmptyFamily ( ImporterIFC importerIFC , Document aDoc , ElementId catId , string familyName )` |
| Method | GetLocalFileName | 2018 | `public static string GetLocalFileName ( Document aDoc , string fileName )` |